In [1]:
import pandas as pd
import numpy as np

In [2]:
dates = pd.date_range('20180401', periods=6)

In [3]:
dates

DatetimeIndex(['2018-04-01', '2018-04-02', '2018-04-03', '2018-04-04',
               '2018-04-05', '2018-04-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [5]:
df

                   A         B         C         D
2018-04-01 -0.715575  0.272446  0.070799  2.208649
2018-04-02 -0.870368 -0.047439 -0.320237 -0.999550
2018-04-03  0.061956 -0.536326  1.355201  0.232113
2018-04-04  0.417430 -0.065861 -0.144255  1.695813
2018-04-05  2.058015  0.420014  0.650237  0.835169
2018-04-06 -0.180614 -0.976017  0.369353 -0.578492

In [6]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [7]:
df.head()

                   A         B         C         D
2018-04-01 -0.715575  0.272446  0.070799  2.208649
2018-04-02 -0.870368 -0.047439 -0.320237 -0.999550
2018-04-03  0.061956 -0.536326  1.355201  0.232113
2018-04-04  0.417430 -0.065861 -0.144255  1.695813
2018-04-05  2.058015  0.420014  0.650237  0.835169

In [8]:
df.tail()

                   A         B         C         D
2018-04-02 -0.870368 -0.047439 -0.320237 -0.999550
2018-04-03  0.061956 -0.536326  1.355201  0.232113
2018-04-04  0.417430 -0.065861 -0.144255  1.695813
2018-04-05  2.058015  0.420014  0.650237  0.835169
2018-04-06 -0.180614 -0.976017  0.369353 -0.578492

In [9]:
df.index

DatetimeIndex(['2018-04-01', '2018-04-02', '2018-04-03', '2018-04-04',
               '2018-04-05', '2018-04-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.values

array([[-0.71557529,  0.2724461 ,  0.07079879,  2.20864944],
       [-0.87036759, -0.04743935, -0.32023683, -0.99954957],
       [ 0.06195604, -0.53632614,  1.35520127,  0.23211284],
       [ 0.41743029, -0.06586116, -0.14425497,  1.695813  ],
       [ 2.05801544,  0.4200144 ,  0.65023677,  0.83516865],
       [-0.1806143 , -0.97601747,  0.36935273, -0.57849157]])

In [11]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.128474 -0.155531  0.330183  0.565617
std    1.059876  0.520066  0.611563  1.258532
min   -0.870368 -0.976017 -0.320237 -0.999550
25%   -0.581835 -0.418710 -0.090492 -0.375840
50%   -0.059329 -0.056650  0.220076  0.533641
75%    0.328562  0.192475  0.580016  1.480652
max    2.058015  0.420014  1.355201  2.208649

In [13]:
df.count()

A    6
B    6
C    6
D    6
dtype: int64

In [14]:
df.T

   2018-04-01  2018-04-02  2018-04-03  2018-04-04  2018-04-05  2018-04-06
A   -0.715575   -0.870368    0.061956    0.417430    2.058015   -0.180614
B    0.272446   -0.047439   -0.536326   -0.065861    0.420014   -0.976017
C    0.070799   -0.320237    1.355201   -0.144255    0.650237    0.369353
D    2.208649   -0.999550    0.232113    1.695813    0.835169   -0.578492

In [15]:
df

                   A         B         C         D
2018-04-01 -0.715575  0.272446  0.070799  2.208649
2018-04-02 -0.870368 -0.047439 -0.320237 -0.999550
2018-04-03  0.061956 -0.536326  1.355201  0.232113
2018-04-04  0.417430 -0.065861 -0.144255  1.695813
2018-04-05  2.058015  0.420014  0.650237  0.835169
2018-04-06 -0.180614 -0.976017  0.369353 -0.578492

In [16]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2018-04-01  2.208649  0.070799  0.272446 -0.715575
2018-04-02 -0.999550 -0.320237 -0.047439 -0.870368
2018-04-03  0.232113  1.355201 -0.536326  0.061956
2018-04-04  1.695813 -0.144255 -0.065861  0.417430
2018-04-05  0.835169  0.650237  0.420014  2.058015
2018-04-06 -0.578492  0.369353 -0.976017 -0.180614

In [17]:
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2018-04-06 -0.180614 -0.976017  0.369353 -0.578492
2018-04-05  2.058015  0.420014  0.650237  0.835169
2018-04-04  0.417430 -0.065861 -0.144255  1.695813
2018-04-03  0.061956 -0.536326  1.355201  0.232113
2018-04-02 -0.870368 -0.047439 -0.320237 -0.999550
2018-04-01 -0.715575  0.272446  0.070799  2.208649

In [18]:
df.sort_values(by='A')

                   A         B         C         D
2018-04-02 -0.870368 -0.047439 -0.320237 -0.999550
2018-04-01 -0.715575  0.272446  0.070799  2.208649
2018-04-06 -0.180614 -0.976017  0.369353 -0.578492
2018-04-03  0.061956 -0.536326  1.355201  0.232113
2018-04-04  0.417430 -0.065861 -0.144255  1.695813
2018-04-05  2.058015  0.420014  0.650237  0.835169

In [19]:
df.sort_values(by='D')

                   A         B         C         D
2018-04-02 -0.870368 -0.047439 -0.320237 -0.999550
2018-04-06 -0.180614 -0.976017  0.369353 -0.578492
2018-04-03  0.061956 -0.536326  1.355201  0.232113
2018-04-05  2.058015  0.420014  0.650237  0.835169
2018-04-04  0.417430 -0.065861 -0.144255  1.695813
2018-04-01 -0.715575  0.272446  0.070799  2.208649

In [20]:
df.sort_values(by='D', ascending=False)

                   A         B         C         D
2018-04-01 -0.715575  0.272446  0.070799  2.208649
2018-04-04  0.417430 -0.065861 -0.144255  1.695813
2018-04-05  2.058015  0.420014  0.650237  0.835169
2018-04-03  0.061956 -0.536326  1.355201  0.232113
2018-04-06 -0.180614 -0.976017  0.369353 -0.578492
2018-04-02 -0.870368 -0.047439 -0.320237 -0.999550

In [21]:
df.A

2018-04-01   -0.715575
2018-04-02   -0.870368
2018-04-03    0.061956
2018-04-04    0.417430
2018-04-05    2.058015
2018-04-06   -0.180614
Freq: D, Name: A, dtype: float64

In [22]:
df.D

2018-04-01    2.208649
2018-04-02   -0.999550
2018-04-03    0.232113
2018-04-04    1.695813
2018-04-05    0.835169
2018-04-06   -0.578492
Freq: D, Name: D, dtype: float64

In [23]:
df['D']

2018-04-01    2.208649
2018-04-02   -0.999550
2018-04-03    0.232113
2018-04-04    1.695813
2018-04-05    0.835169
2018-04-06   -0.578492
Freq: D, Name: D, dtype: float64

In [24]:
df[0:3]

                   A         B         C         D
2018-04-01 -0.715575  0.272446  0.070799  2.208649
2018-04-02 -0.870368 -0.047439 -0.320237 -0.999550
2018-04-03  0.061956 -0.536326  1.355201  0.232113

In [25]:
df['20180401':'20180403']

                   A         B         C         D
2018-04-01 -0.715575  0.272446  0.070799  2.208649
2018-04-02 -0.870368 -0.047439 -0.320237 -0.999550
2018-04-03  0.061956 -0.536326  1.355201  0.232113

In [26]:
df.loc[dates[1]]

A   -0.870368
B   -0.047439
C   -0.320237
D   -0.999550
Name: 2018-04-02 00:00:00, dtype: float64

In [27]:
df.iloc[0:3]

                   A         B         C         D
2018-04-01 -0.715575  0.272446  0.070799  2.208649
2018-04-02 -0.870368 -0.047439 -0.320237 -0.999550
2018-04-03  0.061956 -0.536326  1.355201  0.232113

In [28]:
df[['A', 'B']]

                   A         B
2018-04-01 -0.715575  0.272446
2018-04-02 -0.870368 -0.047439
2018-04-03  0.061956 -0.536326
2018-04-04  0.417430 -0.065861
2018-04-05  2.058015  0.420014
2018-04-06 -0.180614 -0.976017

In [29]:
df.iloc[0:3]

                   A         B         C         D
2018-04-01 -0.715575  0.272446  0.070799  2.208649
2018-04-02 -0.870368 -0.047439 -0.320237 -0.999550
2018-04-03  0.061956 -0.536326  1.355201  0.232113

In [30]:
df.A

2018-04-01   -0.715575
2018-04-02   -0.870368
2018-04-03    0.061956
2018-04-04    0.417430
2018-04-05    2.058015
2018-04-06   -0.180614
Freq: D, Name: A, dtype: float64

In [31]:
df[df.A>0]

                   A         B         C         D
2018-04-03  0.061956 -0.536326  1.355201  0.232113
2018-04-04  0.417430 -0.065861 -0.144255  1.695813
2018-04-05  2.058015  0.420014  0.650237  0.835169

In [32]:
df.A[df.A>0]

2018-04-03    0.061956
2018-04-04    0.417430
2018-04-05    2.058015
Freq: D, Name: A, dtype: float64

In [33]:
df.iat[0, 0]

-0.7155752914957583

In [34]:
df[df>0]

                   A         B         C         D
2018-04-01       NaN  0.272446  0.070799  2.208649
2018-04-02       NaN       NaN       NaN       NaN
2018-04-03  0.061956       NaN  1.355201  0.232113
2018-04-04  0.417430       NaN       NaN  1.695813
2018-04-05  2.058015  0.420014  0.650237  0.835169
2018-04-06       NaN       NaN  0.369353       NaN

In [35]:
df2 = df.copy()
df2['E'] = ['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2018-04-01 -0.715575  0.272446  0.070799  2.208649    one
2018-04-02 -0.870368 -0.047439 -0.320237 -0.999550    one
2018-04-03  0.061956 -0.536326  1.355201  0.232113    two
2018-04-04  0.417430 -0.065861 -0.144255  1.695813  three
2018-04-05  2.058015  0.420014  0.650237  0.835169   four
2018-04-06 -0.180614 -0.976017  0.369353 -0.578492  three

In [36]:
df[df2['E'].isin(['one', 'three'])]

                   A         B         C         D
2018-04-01 -0.715575  0.272446  0.070799  2.208649
2018-04-02 -0.870368 -0.047439 -0.320237 -0.999550
2018-04-04  0.417430 -0.065861 -0.144255  1.695813
2018-04-06 -0.180614 -0.976017  0.369353 -0.578492

In [37]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=dates)
s1

2018-04-01    1
2018-04-02    2
2018-04-03    3
2018-04-04    4
2018-04-05    5
2018-04-06    6
Freq: D, dtype: int64

In [38]:
df['F'] = s1
df

                   A         B         C         D  F
2018-04-01 -0.715575  0.272446  0.070799  2.208649  1
2018-04-02 -0.870368 -0.047439 -0.320237 -0.999550  2
2018-04-03  0.061956 -0.536326  1.355201  0.232113  3
2018-04-04  0.417430 -0.065861 -0.144255  1.695813  4
2018-04-05  2.058015  0.420014  0.650237  0.835169  5
2018-04-06 -0.180614 -0.976017  0.369353 -0.578492  6

In [39]:
df.at[dates[0], 'A'] = 0
df.iat[0, 1] = 0
df

                   A         B         C         D  F
2018-04-01  0.000000  0.000000  0.070799  2.208649  1
2018-04-02 -0.870368 -0.047439 -0.320237 -0.999550  2
2018-04-03  0.061956 -0.536326  1.355201  0.232113  3
2018-04-04  0.417430 -0.065861 -0.144255  1.695813  4
2018-04-05  2.058015  0.420014  0.650237  0.835169  5
2018-04-06 -0.180614 -0.976017  0.369353 -0.578492  6

In [40]:
df2 = df.copy()
df2[df<0] = -df
df2

                   A         B         C         D  F
2018-04-01  0.000000  0.000000  0.070799  2.208649  1
2018-04-02  0.870368  0.047439  0.320237  0.999550  2
2018-04-03  0.061956  0.536326  1.355201  0.232113  3
2018-04-04  0.417430  0.065861  0.144255  1.695813  4
2018-04-05  2.058015  0.420014  0.650237  0.835169  5
2018-04-06  0.180614  0.976017  0.369353  0.578492  6

In [41]:
df1 = df.reindex(index=dates[0:3], columns=list('AC')+['E'])
df1

                   A         C   E
2018-04-01  0.000000  0.070799 NaN
2018-04-02 -0.870368 -0.320237 NaN
2018-04-03  0.061956  1.355201 NaN

In [42]:
df1.loc[dates[0:2], 'E'] = 1
df1

                   A         C    E
2018-04-01  0.000000  0.070799  1.0
2018-04-02 -0.870368 -0.320237  1.0
2018-04-03  0.061956  1.355201  NaN

In [43]:
df1.dropna(how='any')

                   A         C    E
2018-04-01  0.000000  0.070799  1.0
2018-04-02 -0.870368 -0.320237  1.0

In [44]:
df1.fillna(value=np.pi)

                   A         C         E
2018-04-01  0.000000  0.070799  1.000000
2018-04-02 -0.870368 -0.320237  1.000000
2018-04-03  0.061956  1.355201  3.141593

In [45]:
rng = pd.date_range('20180401', periods=10000, freq='S')
rng[-1]

Timestamp('2018-04-01 02:46:39', freq='S')

In [47]:
ts = pd.Series(np.random.randn(len(rng)), index=rng)

In [55]:
ts.resample('min').apply(np.std)

2018-04-01 00:00:00    0.883314
2018-04-01 00:01:00    0.878515
2018-04-01 00:02:00    1.122213
2018-04-01 00:03:00    0.993219
2018-04-01 00:04:00    0.999972
2018-04-01 00:05:00    1.034796
2018-04-01 00:06:00    1.079767
2018-04-01 00:07:00    0.974903
2018-04-01 00:08:00    0.949350
2018-04-01 00:09:00    0.796198
2018-04-01 00:10:00    0.940549
2018-04-01 00:11:00    0.936601
2018-04-01 00:12:00    0.966259
2018-04-01 00:13:00    0.986021
2018-04-01 00:14:00    0.904343
2018-04-01 00:15:00    0.998461
2018-04-01 00:16:00    1.079221
2018-04-01 00:17:00    0.941515
2018-04-01 00:18:00    1.046707
2018-04-01 00:19:00    1.029592
2018-04-01 00:20:00    1.103721
2018-04-01 00:21:00    1.038824
2018-04-01 00:22:00    1.093716
2018-04-01 00:23:00    1.146501
2018-04-01 00:24:00    1.271111
2018-04-01 00:25:00    0.897039
2018-04-01 00:26:00    0.926931
2018-04-01 00:27:00    1.032020
2018-04-01 00:28:00    0.915380
2018-04-01 00:29:00    1.128402
                         ...
2018-04-01 02:17:00    0.898534
2018-04-01 02:18:00    0.948315
2018-04-01 02:19:00    1.101422
2018-04-01 02:20:00    1.006961
2018-04-01 02:21:00    0.948176
2018-04-01 02:22:00    1.027634
2018-04-01 02:23:00    0.942594
2018-04-01 02:24:00    0.814057
2018-04-01 02:25:00    0.971660
2018-04-01 02:26:00    1.049770
2018-04-01 02:27:00    0.975079
2018-04-01 02:28:00    0.956032
2018-04-01 02:29:00    1.138452
2018-04-01 02:30:00    0.989315
2018-04-01 02:31:00    0.876230
2018-04-01 02:32:00    1.031987
2018-04-01 02:33:00    0.831510
2018-04-01 02:34:00    1.065360
2018-04-01 02:35:00    0.952823
2018-04-01 02:36:00    1.049153
2018-04-01 02:37:00    0.955597
2018-04-01 02:38:00    1.236364
2018-04-01 02:39:00    1.181054
2018-04-01 02:40:00    0.900686
2018-04-01 02:41:00    0.825777
2018-04-01 02:42:00    0.901353
2018-04-01 02:43:00    0.988063
2018-04-01 02:44:00    1.070509
2018-04-01 02:45:00    1.048249
2018-04-01 02:46:00    1.248345
Freq: T, Length: 167, dtype: float64

In [61]:
rng = pd.date_range('20180101', periods=10, freq='M')
tm = pd.Series(np.random.randn(len(rng)), index=rng)
tm

2018-01-31    0.861332
2018-02-28   -0.349774
2018-03-31    0.391079
2018-04-30   -1.291426
2018-05-31   -0.168239
2018-06-30    1.714257
2018-07-31   -0.048062
2018-08-31   -1.072855
2018-09-30    0.394020
2018-10-31    0.300961
Freq: M, dtype: float64

In [62]:
ps = tm.to_period()
ps

2018-01    0.861332
2018-02   -0.349774
2018-03    0.391079
2018-04   -1.291426
2018-05   -0.168239
2018-06    1.714257
2018-07   -0.048062
2018-08   -1.072855
2018-09    0.394020
2018-10    0.300961
Freq: M, dtype: float64

In [63]:
tm.to_timestamp

<bound method Series.to_timestamp of 2018-01-31    0.861332
2018-02-28   -0.349774
2018-03-31    0.391079
2018-04-30   -1.291426
2018-05-31   -0.168239
2018-06-30    1.714257
2018-07-31   -0.048062
2018-08-31   -1.072855
2018-09-30    0.394020
2018-10-31    0.300961
Freq: M, dtype: float64>

In [64]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')
ts = pd.Series(np.random.randn(len(prng)), prng)
ts

1990Q1    0.918984
1990Q2   -2.077410
1990Q3    0.390083
1990Q4    0.117009
1991Q1    0.064800
1991Q2   -1.567158
1991Q3    0.712597
1991Q4    0.633760
1992Q1   -0.458907
1992Q2    1.469526
1992Q3   -0.967860
1992Q4    0.825547
1993Q1   -0.694485
1993Q2    0.699307
1993Q3    0.774136
1993Q4    0.509790
1994Q1    0.758783
1994Q2   -0.839797
1994Q3   -0.258421
1994Q4   -0.305037
1995Q1    0.299827
1995Q2    0.376875
1995Q3    0.331069
1995Q4   -0.177290
1996Q1   -2.269229
1996Q2    0.669925
1996Q3   -0.040677
1996Q4   -1.228986
1997Q1    1.032060
1997Q2   -0.848015
1997Q3   -0.052431
1997Q4   -0.429857
1998Q1    0.953731
1998Q2   -0.415340
1998Q3   -1.086280
1998Q4   -1.846397
1999Q1    0.087299
1999Q2   -1.242740
1999Q3   -1.413388
1999Q4    0.822287
2000Q1    0.282742
2000Q2    1.238703
2000Q3    0.207310
2000Q4    1.686414
Freq: Q-NOV, dtype: float64

In [69]:
prng.asfreq('M', 'e')

PeriodIndex(['1990-02', '1990-05', '1990-08', '1990-11', '1991-02', '1991-05',
             '1991-08', '1991-11', '1992-02', '1992-05', '1992-08', '1992-11',
             '1993-02', '1993-05', '1993-08', '1993-11', '1994-02', '1994-05',
             '1994-08', '1994-11', '1995-02', '1995-05', '1995-08', '1995-11',
             '1996-02', '1996-05', '1996-08', '1996-11', '1997-02', '1997-05',
             '1997-08', '1997-11', '1998-02', '1998-05', '1998-08', '1998-11',
             '1999-02', '1999-05', '1999-08', '1999-11', '2000-02', '2000-05',
             '2000-08', '2000-11'],
            dtype='period[M]', freq='M')

In [70]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [75]:
df['grade'] = df.raw_grade.astype('category')
df.dtypes

id              int64
raw_grade      object
grade        category
dtype: object

In [80]:
df['grade'].cat.categories = ["ha", "hahaha", "haha"]
df.sort_values(by='grade', ascending=False)

   id raw_grade      grade
5   6         e   very bad
2   3         b       good
1   2         b       good
4   5         a  very good
3   4         a  very good
0   1         a  very good